levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a2.h
/*  Bit definition for NFC_ECC_SYND9_3 register  */
#define NFC_ECC_SYND9_3_S7_POS                         (0U)
#define NFC_ECC_SYND9_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND9_3_S8_POS                         (16U)
#define NFC_ECC_SYND9_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND10_0 register  */
#define NFC_ECC_SYND10_0_S1_POS                        (0U)
#define NFC_ECC_SYND10_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND10_0_S2_POS                        (16U)
#define NFC_ECC_SYND10_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND10_1 register  */
#define NFC_ECC_SYND10_1_S3_POS                        (0U)
#define NFC_ECC_SYND10_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND10_1_S4_POS                        (16U)
#define NFC_ECC_SYND10_1_S4                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND10_2 register  */
#define NFC_ECC_SYND10_2_S5_POS                        (0U)
#define NFC_ECC_SYND10_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND10_2_S6_POS                        (16U)
#define NFC_ECC_SYND10_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND10_3 register  */
#define NFC_ECC_SYND10_3_S7_POS                        (0U)
#define NFC_ECC_SYND10_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND10_3_S8_POS                        (16U)
#define NFC_ECC_SYND10_3_S8                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND11_0 register  */
#define NFC_ECC_SYND11_0_S1_POS                        (0U)
#define NFC_ECC_SYND11_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND11_0_S2_POS                        (16U)
#define NFC_ECC_SYND11_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND11_1 register  */
#define NFC_ECC_SYND11_1_S3_POS                        (0U)
#define NFC_ECC_SYND11_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND11_1_S4_POS                        (16U)
#define NFC_ECC_SYND11_1_S4                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND11_2 register  */
#define NFC_ECC_SYND11_2_S5_POS                        (0U)
#define NFC_ECC_SYND11_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND11_2_S6_POS                        (16U)
#define NFC_ECC_SYND11_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND11_3 register  */
#define NFC_ECC_SYND11_3_S7_POS                        (0U)
#define NFC_ECC_SYND11_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND11_3_S8_POS                        (16U)
#define NFC_ECC_SYND11_3_S8                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND12_0 register  */
#define NFC_ECC_SYND12_0_S1_POS                        (0U)
#define NFC_ECC_SYND12_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND12_0_S2_POS                        (16U)
#define NFC_ECC_SYND12_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND12_1 register  */
#define NFC_ECC_SYND12_1_S3_POS                        (0U)
#define NFC_ECC_SYND12_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND12_1_S4_POS                        (16U)
#define NFC_ECC_SYND12_1_S4                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND12_2 register  */
#define NFC_ECC_SYND12_2_S5_POS                        (0U)
#define NFC_ECC_SYND12_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND12_2_S6_POS                        (16U)
#define NFC_ECC_SYND12_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND12_3 register  */
#define NFC_ECC_SYND12_3_S7_POS                        (0U)
#define NFC_ECC_SYND12_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND12_3_S8_POS                        (16U)
#define NFC_ECC_SYND12_3_S8                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND13_0 register  */
#define NFC_ECC_SYND13_0_S1_POS                        (0U)
#define NFC_ECC_SYND13_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND13_0_S2_POS                        (16U)
#define NFC_ECC_SYND13_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND13_1 register  */
#define NFC_ECC_SYND13_1_S3_POS                        (0U)
#define NFC_ECC_SYND13_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND13_1_S4_POS                        (16U)
#define NFC_ECC_SYND13_1_S4                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND13_2 register  */
#define NFC_ECC_SYND13_2_S5_POS                        (0U)
#define NFC_ECC_SYND13_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND13_2_S6_POS                        (16U)
#define NFC_ECC_SYND13_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND13_3 register  */
#define NFC_ECC_SYND13_3_S7_POS                        (0U)
#define NFC_ECC_SYND13_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND13_3_S8_POS                        (16U)
#define NFC_ECC_SYND13_3_S8                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND14_0 register  */
#define NFC_ECC_SYND14_0_S1_POS                        (0U)
#define NFC_ECC_SYND14_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND14_0_S2_POS                        (16U)
#define NFC_ECC_SYND14_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND14_1 register  */
#define NFC_ECC_SYND14_1_S3_POS                        (0U)
#define NFC_ECC_SYND14_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND14_1_S4_POS                        (16U)
#define NFC_ECC_SYND14_1_S4                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND14_2 register  */
#define NFC_ECC_SYND14_2_S5_POS                        (0U)
#define NFC_ECC_SYND14_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND14_2_S6_POS                        (16U)
#define NFC_ECC_SYND14_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND14_3 register  */
#define NFC_ECC_SYND14_3_S7_POS                        (0U)
#define NFC_ECC_SYND14_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND14_3_S8_POS                        (16U)
#define NFC_ECC_SYND14_3_S8                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND15_0 register  */
#define NFC_ECC_SYND15_0_S1_POS                        (0U)
#define NFC_ECC_SYND15_0_S1                            (0x00001FFFUL)
#define NFC_ECC_SYND15_0_S2_POS                        (16U)
#define NFC_ECC_SYND15_0_S2                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND15_1 register  */
#define NFC_ECC_SYND15_1_S3_POS                        (0U)
#define NFC_ECC_SYND15_1_S3                            (0x00001FFFUL)
#define NFC_ECC_SYND15_1_S4_POS                        (16U)
#define NFC_ECC_SYND15_1_S4                            (0x1FFF0000UL)

