levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a2.h
/*  Bit definition for NFC_ECC_SYND15_2 register  */
#define NFC_ECC_SYND15_2_S5_POS                        (0U)
#define NFC_ECC_SYND15_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND15_2_S6_POS                        (16U)
#define NFC_ECC_SYND15_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND15_3 register  */
#define NFC_ECC_SYND15_3_S7_POS                        (0U)
#define NFC_ECC_SYND15_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND15_3_S8_POS                        (16U)
#define NFC_ECC_SYND15_3_S8                            (0x1FFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_PDR register  */
#define OTS_PDR_TSPD1_POS                              (0U)
#define OTS_PDR_TSPD1                                  (0x0000FFFFUL)
#define OTS_PDR_TSPD2_POS                              (16U)
#define OTS_PDR_TSPD2                                  (0xFFFF0000UL)

/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR register  */
#define OTS_DR                                         (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USB_SYCTLREG register  */
#define PERIC_USB_SYCTLREG_USBFS_DFB_POS               (0U)
#define PERIC_USB_SYCTLREG_USBFS_DFB                   (0x00000001UL)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN_POS             (1U)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN                 (0x00000002UL)
#define PERIC_USB_SYCTLREG_USBHS_DFB_POS               (8U)
#define PERIC_USB_SYCTLREG_USBHS_DFB                   (0x00000100UL)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN_POS             (9U)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN                 (0x00000200UL)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE_POS            (10U)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE                (0x00000400UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_USB_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_USB_SYCTLREG_USBFS_NFE                   (0x00040000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_POS               (24U)
#define PERIC_USB_SYCTLREG_USBHS_NFS                   (0x03000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_0                 (0x01000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_1                 (0x02000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFE_POS               (26U)
#define PERIC_USB_SYCTLREG_USBHS_NFE                   (0x04000000UL)

/*  Bit definition for PERIC_SDIOC_SYCTLREG register  */
#define PERIC_SDIOC_SYCTLREG_SELMMC1_POS               (1U)
#define PERIC_SDIOC_SYCTLREG_SELMMC1                   (0x00000002UL)
#define PERIC_SDIOC_SYCTLREG_SELMMC2_POS               (3U)
#define PERIC_SDIOC_SYCTLREG_SELMMC2                   (0x00000008UL)

/*  Bit definition for PERIC_NFC_STCR register  */
#define PERIC_NFC_STCR_OPENP                           (0x00000001UL)

/*  Bit definition for PERIC_NFC_ENAR register  */
#define PERIC_NFC_ENAR_NFCEN_POS                       (2U)
#define PERIC_NFC_ENAR_NFCEN                           (0x00000004UL)

/*  Bit definition for PERIC_SMC_ENAR register  */
#define PERIC_SMC_ENAR_SMCEN_POS                       (1U)
#define PERIC_SMC_ENAR_SMCEN                           (0x00000002UL)

/*  Bit definition for PERIC_DMC_ENAR register  */
#define PERIC_DMC_ENAR_DMCEN                           (0x00000001UL)

/*  Bit definition for PERIC_USART1_NFC register  */
#define PERIC_USART1_NFC_USASRT1_NFS_POS               (0U)
#define PERIC_USART1_NFC_USASRT1_NFS                   (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0                 (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1                 (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS                (2U)
#define PERIC_USART1_NFC_USART1_NFE                    (0x00000004UL)

/*  Bit definition for PERIC_NFC_STSR register  */
#define PERIC_NFC_STSR_CHIP_BUSY_POS                   (0U)
#define PERIC_NFC_STSR_CHIP_BUSY                       (0x000000FFUL)
#define PERIC_NFC_STSR_CHIP_BUSY_0                     (0x00000001UL)
#define PERIC_NFC_STSR_CHIP_BUSY_1                     (0x00000002UL)
#define PERIC_NFC_STSR_CHIP_BUSY_2                     (0x00000004UL)
#define PERIC_NFC_STSR_CHIP_BUSY_3                     (0x00000008UL)
#define PERIC_NFC_STSR_CHIP_BUSY_4                     (0x00000010UL)
#define PERIC_NFC_STSR_CHIP_BUSY_5                     (0x00000020UL)
#define PERIC_NFC_STSR_CHIP_BUSY_6                     (0x00000040UL)
#define PERIC_NFC_STSR_CHIP_BUSY_7                     (0x00000080UL)
#define PERIC_NFC_STSR_PECC_POS                        (8U)
#define PERIC_NFC_STSR_PECC                            (0x00000100UL)

/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_FCG0 register  */
#define PWC_FCG0_SRAMH_POS                             (0U)
#define PWC_FCG0_SRAMH                                 (0x00000001UL)
#define PWC_FCG0_SRAM1_POS                             (4U)
#define PWC_FCG0_SRAM1                                 (0x00000010UL)
#define PWC_FCG0_SRAM2_POS                             (5U)
#define PWC_FCG0_SRAM2                                 (0x00000020UL)
#define PWC_FCG0_SRAM3_POS                             (6U)
#define PWC_FCG0_SRAM3                                 (0x00000040UL)
#define PWC_FCG0_SRAM4_POS                             (7U)
#define PWC_FCG0_SRAM4                                 (0x00000080UL)
#define PWC_FCG0_SRAMB_POS                             (10U)
#define PWC_FCG0_SRAMB                                 (0x00000400UL)
#define PWC_FCG0_KEY_POS                               (13U)
#define PWC_FCG0_KEY                                   (0x00002000UL)
#define PWC_FCG0_DMA1_POS                              (14U)
#define PWC_FCG0_DMA1                                  (0x00004000UL)
#define PWC_FCG0_DMA2_POS                              (15U)
#define PWC_FCG0_DMA2                                  (0x00008000UL)
#define PWC_FCG0_FCM_POS                               (16U)
#define PWC_FCG0_FCM                                   (0x00010000UL)
#define PWC_FCG0_AOS_POS                               (17U)
#define PWC_FCG0_AOS                                   (0x00020000UL)
#define PWC_FCG0_CTC_POS                               (18U)
#define PWC_FCG0_CTC                                   (0x00040000UL)
#define PWC_FCG0_MAU_POS                               (19U)
#define PWC_FCG0_MAU                                   (0x00080000UL)
#define PWC_FCG0_AES_POS                               (20U)
#define PWC_FCG0_AES                                   (0x00100000UL)
#define PWC_FCG0_HASH_POS                              (21U)
#define PWC_FCG0_HASH                                  (0x00200000UL)
#define PWC_FCG0_TRNG_POS                              (22U)
#define PWC_FCG0_TRNG                                  (0x00400000UL)
#define PWC_FCG0_CRC_POS                               (23U)
#define PWC_FCG0_CRC                                   (0x00800000UL)
#define PWC_FCG0_DCU1_POS                              (24U)
#define PWC_FCG0_DCU1                                  (0x01000000UL)
#define PWC_FCG0_DCU2_POS                              (25U)
#define PWC_FCG0_DCU2                                  (0x02000000UL)
#define PWC_FCG0_DCU3_POS                              (26U)
#define PWC_FCG0_DCU3                                  (0x04000000UL)
#define PWC_FCG0_DCU4_POS                              (27U)
#define PWC_FCG0_DCU4                                  (0x08000000UL)
#define PWC_FCG0_DCU5_POS                              (28U)
#define PWC_FCG0_DCU5                                  (0x10000000UL)
#define PWC_FCG0_DCU6_POS                              (29U)
#define PWC_FCG0_DCU6                                  (0x20000000UL)
#define PWC_FCG0_DCU7_POS                              (30U)
#define PWC_FCG0_DCU7                                  (0x40000000UL)
#define PWC_FCG0_DCU8_POS                              (31U)
#define PWC_FCG0_DCU8                                  (0x80000000UL)

/*  Bit definition for PWC_FCG1 register  */
#define PWC_FCG1_CAN1_POS                              (0U)
#define PWC_FCG1_CAN1                                  (0x00000001UL)
#define PWC_FCG1_CAN2_POS                              (1U)
#define PWC_FCG1_CAN2                                  (0x00000002UL)
#define PWC_FCG1_ETHMAC_POS                            (2U)
#define PWC_FCG1_ETHMAC                                (0x00000004UL)
#define PWC_FCG1_QSPI_POS                              (3U)
#define PWC_FCG1_QSPI                                  (0x00000008UL)
#define PWC_FCG1_I2C1_POS                              (4U)
#define PWC_FCG1_I2C1                                  (0x00000010UL)
#define PWC_FCG1_I2C2_POS                              (5U)
#define PWC_FCG1_I2C2                                  (0x00000020UL)
#define PWC_FCG1_I2C3_POS                              (6U)
#define PWC_FCG1_I2C3                                  (0x00000040UL)
#define PWC_FCG1_I2C4_POS                              (7U)
#define PWC_FCG1_I2C4                                  (0x00000080UL)
#define PWC_FCG1_I2C5_POS                              (8U)
#define PWC_FCG1_I2C5                                  (0x00000100UL)
#define PWC_FCG1_I2C6_POS                              (9U)
#define PWC_FCG1_I2C6                                  (0x00000200UL)
#define PWC_FCG1_SDIOC1_POS                            (10U)
#define PWC_FCG1_SDIOC1                                (0x00000400UL)
#define PWC_FCG1_SDIOC2_POS                            (11U)
#define PWC_FCG1_SDIOC2                                (0x00000800UL)
#define PWC_FCG1_I2S1_POS                              (12U)
#define PWC_FCG1_I2S1                                  (0x00001000UL)
#define PWC_FCG1_I2S2_POS                              (13U)
#define PWC_FCG1_I2S2                                  (0x00002000UL)
#define PWC_FCG1_I2S3_POS                              (14U)
#define PWC_FCG1_I2S3                                  (0x00004000UL)
#define PWC_FCG1_I2S4_POS                              (15U)
#define PWC_FCG1_I2S4                                  (0x00008000UL)
#define PWC_FCG1_SPI1_POS                              (16U)
#define PWC_FCG1_SPI1                                  (0x00010000UL)
#define PWC_FCG1_SPI2_POS                              (17U)
#define PWC_FCG1_SPI2                                  (0x00020000UL)
#define PWC_FCG1_SPI3_POS                              (18U)
#define PWC_FCG1_SPI3                                  (0x00040000UL)
#define PWC_FCG1_SPI4_POS                              (19U)
#define PWC_FCG1_SPI4                                  (0x00080000UL)
#define PWC_FCG1_SPI5_POS                              (20U)
#define PWC_FCG1_SPI5                                  (0x00100000UL)
#define PWC_FCG1_SPI6_POS                              (21U)
#define PWC_FCG1_SPI6                                  (0x00200000UL)
#define PWC_FCG1_USBFS_POS                             (22U)
#define PWC_FCG1_USBFS                                 (0x00400000UL)
#define PWC_FCG1_USBHS_POS                             (23U)
#define PWC_FCG1_USBHS                                 (0x00800000UL)
#define PWC_FCG1_FMAC1_POS                             (24U)
#define PWC_FCG1_FMAC1                                 (0x01000000UL)
#define PWC_FCG1_FMAC2_POS                             (25U)
#define PWC_FCG1_FMAC2                                 (0x02000000UL)
#define PWC_FCG1_FMAC3_POS                             (26U)
#define PWC_FCG1_FMAC3                                 (0x04000000UL)
#define PWC_FCG1_FMAC4_POS                             (27U)
#define PWC_FCG1_FMAC4                                 (0x08000000UL)

/*  Bit definition for PWC_FCG2 register  */
#define PWC_FCG2_TMR6_1_POS                            (0U)
#define PWC_FCG2_TMR6_1                                (0x00000001UL)
#define PWC_FCG2_TMR6_2_POS                            (1U)
#define PWC_FCG2_TMR6_2                                (0x00000002UL)
#define PWC_FCG2_TMR6_3_POS                            (2U)
#define PWC_FCG2_TMR6_3                                (0x00000004UL)
#define PWC_FCG2_TMR6_4_POS                            (3U)
#define PWC_FCG2_TMR6_4                                (0x00000008UL)
#define PWC_FCG2_TMR6_5_POS                            (4U)
#define PWC_FCG2_TMR6_5                                (0x00000010UL)
#define PWC_FCG2_TMR6_6_POS                            (5U)
#define PWC_FCG2_TMR6_6                                (0x00000020UL)
#define PWC_FCG2_TMR6_7_POS                            (6U)
#define PWC_FCG2_TMR6_7                                (0x00000040UL)
#define PWC_FCG2_TMR6_8_POS                            (7U)
#define PWC_FCG2_TMR6_8                                (0x00000080UL)
#define PWC_FCG2_TMR4_1_POS                            (8U)
#define PWC_FCG2_TMR4_1                                (0x00000100UL)
#define PWC_FCG2_TMR4_2_POS                            (9U)
#define PWC_FCG2_TMR4_2                                (0x00000200UL)
#define PWC_FCG2_TMR4_3_POS                            (10U)
#define PWC_FCG2_TMR4_3                                (0x00000400UL)
#define PWC_FCG2_HRPWM_POS                             (11U)
#define PWC_FCG2_HRPWM                                 (0x00000800UL)
#define PWC_FCG2_TMR0_1_POS                            (12U)
#define PWC_FCG2_TMR0_1                                (0x00001000UL)
#define PWC_FCG2_TMR0_2_POS                            (13U)
#define PWC_FCG2_TMR0_2                                (0x00002000UL)
#define PWC_FCG2_EMB_POS                               (15U)
#define PWC_FCG2_EMB                                   (0x00008000UL)
#define PWC_FCG2_TMR2_1_POS                            (16U)
#define PWC_FCG2_TMR2_1                                (0x00010000UL)
#define PWC_FCG2_TMR2_2_POS                            (17U)
#define PWC_FCG2_TMR2_2                                (0x00020000UL)
#define PWC_FCG2_TMR2_3_POS                            (18U)
#define PWC_FCG2_TMR2_3                                (0x00040000UL)
#define PWC_FCG2_TMR2_4_POS                            (19U)
#define PWC_FCG2_TMR2_4                                (0x00080000UL)
#define PWC_FCG2_TMRA_1_POS                            (20U)
#define PWC_FCG2_TMRA_1                                (0x00100000UL)
#define PWC_FCG2_TMRA_2_POS                            (21U)
#define PWC_FCG2_TMRA_2                                (0x00200000UL)
#define PWC_FCG2_TMRA_3_POS                            (22U)
#define PWC_FCG2_TMRA_3                                (0x00400000UL)
#define PWC_FCG2_TMRA_4_POS                            (23U)
#define PWC_FCG2_TMRA_4                                (0x00800000UL)
#define PWC_FCG2_TMRA_5_POS                            (24U)
#define PWC_FCG2_TMRA_5                                (0x01000000UL)
#define PWC_FCG2_TMRA_6_POS                            (25U)
#define PWC_FCG2_TMRA_6                                (0x02000000UL)
#define PWC_FCG2_TMRA_7_POS                            (26U)
#define PWC_FCG2_TMRA_7                                (0x04000000UL)
#define PWC_FCG2_TMRA_8_POS                            (27U)
#define PWC_FCG2_TMRA_8                                (0x08000000UL)
#define PWC_FCG2_TMRA_9_POS                            (28U)
#define PWC_FCG2_TMRA_9                                (0x10000000UL)
#define PWC_FCG2_TMRA_10_POS                           (29U)
#define PWC_FCG2_TMRA_10                               (0x20000000UL)
#define PWC_FCG2_TMRA_11_POS                           (30U)
#define PWC_FCG2_TMRA_11                               (0x40000000UL)
#define PWC_FCG2_TMRA_12_POS                           (31U)
#define PWC_FCG2_TMRA_12                               (0x80000000UL)

