levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a2.h
typedef struct {
    __IO uint32_t SMIB;
    __IO uint32_t SMIW;
    __IO uint32_t SMIC0;
    __IO uint32_t SMIC1;
    __IO uint32_t SMIC2;
    __IO uint32_t SMIC3;
    __IO uint32_t SMIR0;
    __IO uint32_t SMIR1;
    __IO uint32_t SMIR2;
    __IO uint32_t SMIR3;
    __IO uint32_t SMIR4;
    __IO uint32_t SMIA0;
    __IO uint32_t SMIA1;
    __IO uint32_t SMIA2;
    __IO uint32_t SMIA3;
    __IO uint32_t SMIA4;
    uint32_t RESERVED0[16];
} stc_eth_mac_smiaddr_bit_t;

typedef struct {
    __IO uint32_t FCA_BPA;
    __IO uint32_t TFE;
    __IO uint32_t RFE;
    __IO uint32_t UNP;
    __IO uint32_t PLT0;
    __IO uint32_t PLT1;
    uint32_t RESERVED0[1];
    __IO uint32_t DZPQ;
    uint32_t RESERVED1[24];
} stc_eth_mac_floctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __IO uint32_t VTAL;
    __IO uint32_t VTIM;
    uint32_t RESERVED1[1];
    __IO uint32_t VTHM;
    uint32_t RESERVED2[12];
} stc_eth_mac_vtafltr_bit_t;

typedef struct {
    __I  uint32_t MREA;
    __I  uint32_t MRS0;
    __I  uint32_t MRS1;
    uint32_t RESERVED0[1];
    __I  uint32_t RFWA;
    __I  uint32_t RFRS0;
    __I  uint32_t RFRS1;
    uint32_t RESERVED1[1];
    __I  uint32_t RFFL0;
    __I  uint32_t RFFL1;
    uint32_t RESERVED2[6];
    __I  uint32_t MTEA;
    __I  uint32_t MTS0;
    __I  uint32_t MTS1;
    __I  uint32_t MTP;
    __I  uint32_t TFRS0;
    __I  uint32_t TFRS1;
    __I  uint32_t TFWA;
    uint32_t RESERVED3[1];
    __I  uint32_t TFNE;
    __I  uint32_t TFF;
    uint32_t RESERVED4[6];
} stc_eth_mac_macstsr_bit_t;

typedef struct {
    __IO uint32_t PWDN;
    __IO uint32_t MPEN;
    __IO uint32_t WKEN;
    uint32_t RESERVED0[2];
    __I  uint32_t MPFR;
    __I  uint32_t WKFR;
    uint32_t RESERVED1[2];
    __IO uint32_t GLUB;
    __IO uint32_t RTWKTR;
    uint32_t RESERVED2[13];
    __I  uint32_t RTWKPT0;
    __I  uint32_t RTWKPT1;
    __I  uint32_t RTWKPT2;
    uint32_t RESERVED3[4];
    __IO uint32_t RTWKFR;
} stc_eth_mac_pmtctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t PMTIS;
    __I  uint32_t MMCIS;
    __I  uint32_t MMCRXIS;
    __I  uint32_t MMCTXIS;
    uint32_t RESERVED1[2];
    __I  uint32_t TSPIS;
    uint32_t RESERVED2[22];
} stc_eth_mac_intstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIM;
    uint32_t RESERVED1[5];
    __IO uint32_t TSPIM;
    uint32_t RESERVED2[22];
} stc_eth_mac_intmskr_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __I  uint32_t AE0;
} stc_eth_mac_macadhr0_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __IO uint32_t MBC10;
    __IO uint32_t MBC11;
    __IO uint32_t MBC12;
    __IO uint32_t MBC13;
    __IO uint32_t MBC14;
    __IO uint32_t MBC15;
    __IO uint32_t SA1;
    __IO uint32_t AE1;
} stc_eth_mac_macadhr1_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __IO uint32_t MBC20;
    __IO uint32_t MBC21;
    __IO uint32_t MBC22;
    __IO uint32_t MBC23;
    __IO uint32_t MBC24;
    __IO uint32_t MBC25;
    __IO uint32_t SA2;
    __IO uint32_t AE2;
} stc_eth_mac_macadhr2_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __IO uint32_t MBC30;
    __IO uint32_t MBC31;
    __IO uint32_t MBC32;
    __IO uint32_t MBC33;
    __IO uint32_t MBC34;
    __IO uint32_t MBC35;
    __IO uint32_t SA3;
    __IO uint32_t AE3;
} stc_eth_mac_macadhr3_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __IO uint32_t MBC40;
    __IO uint32_t MBC41;
    __IO uint32_t MBC42;
    __IO uint32_t MBC43;
    __IO uint32_t MBC44;
    __IO uint32_t MBC45;
    __IO uint32_t SA4;
    __IO uint32_t AE4;
} stc_eth_mac_macadhr4_bit_t;

typedef struct {
    __IO uint32_t CRST;
    __IO uint32_t COS;
    __IO uint32_t ROR;
    __IO uint32_t MCF;
    __IO uint32_t MCPSET;
    __IO uint32_t MCPSEL;
    uint32_t RESERVED0[26];
} stc_eth_mmc_mmcctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t RXBGIS;
    __I  uint32_t RXMGIS;
    __I  uint32_t RXCEIS;
    __I  uint32_t RXAEIS;
    __I  uint32_t RXREIS;
    uint32_t RESERVED1[9];
    __I  uint32_t RXUGIS;
    __I  uint32_t RXLEIS;
    __I  uint32_t RXOEIS;
    uint32_t RESERVED2[12];
} stc_eth_mmc_revstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __I  uint32_t TXBGIS;
    __I  uint32_t TXMGIS;
    uint32_t RESERVED1[12];
    __I  uint32_t TXDEEIS;
    __I  uint32_t TXLCEIS;
    __I  uint32_t TXECEIS;
    __I  uint32_t TXCAEIS;
    uint32_t RESERVED2[1];
    __I  uint32_t TXUGIS;
    __I  uint32_t TXEDEIS;
    uint32_t RESERVED3[9];
} stc_eth_mmc_trsstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIM;
    __IO uint32_t RXMGIM;
    __IO uint32_t RXCEIM;
    __IO uint32_t RXAEIM;
    __IO uint32_t RXREIM;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIM;
    __IO uint32_t RXLEIM;
    __IO uint32_t RXOEIM;
    uint32_t RESERVED2[12];
} stc_eth_mmc_ritctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIM;
    __IO uint32_t TXMGIM;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIM;
    __IO uint32_t TXLCEIM;
    __IO uint32_t TXECEIM;
    __IO uint32_t TXCAEIM;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIM;
    __IO uint32_t TXEDEIM;
    uint32_t RESERVED3[9];
} stc_eth_mmc_titctlr_bit_t;

typedef struct {
    __IO uint32_t L3PEN;
    uint32_t RESERVED0[1];
    __IO uint32_t L3SAM;
    __IO uint32_t L3SAIM;
    __IO uint32_t L3DAM;
    __IO uint32_t L3DAIM;
    __IO uint32_t L3HSBM0;
    __IO uint32_t L3HSBM1;
    __IO uint32_t L3HSBM2;
    __IO uint32_t L3HSBM3;
    __IO uint32_t L3HSBM4;
    __IO uint32_t L3HDBM0;
    __IO uint32_t L3HDBM1;
    __IO uint32_t L3HDBM2;
    __IO uint32_t L3HDBM3;
    __IO uint32_t L3HDBM4;
    __IO uint32_t L4PEN;
    uint32_t RESERVED1[1];
    __IO uint32_t L4SPM;
    __IO uint32_t L4SPIM;
    __IO uint32_t L4DPM;
    __IO uint32_t L4DPIM;
    uint32_t RESERVED2[10];
} stc_eth_mac_l34ctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __IO uint32_t VLANC0;
    __IO uint32_t VLANC1;
    __IO uint32_t VLANS;
    uint32_t RESERVED1[13];
} stc_eth_mac_vtactlr_bit_t;

