levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a2.h
typedef struct {
    __IO uint32_t KEYINSEL0;
    __IO uint32_t KEYINSEL1;
    __IO uint32_t KEYINSEL2;
    __IO uint32_t KEYINSEL3;
    __IO uint32_t KEYINSEL4;
    __IO uint32_t KEYINSEL5;
    __IO uint32_t KEYINSEL6;
    __IO uint32_t KEYINSEL7;
    __IO uint32_t KEYINSEL8;
    __IO uint32_t KEYINSEL9;
    __IO uint32_t KEYINSEL10;
    __IO uint32_t KEYINSEL11;
    __IO uint32_t KEYINSEL12;
    __IO uint32_t KEYINSEL13;
    __IO uint32_t KEYINSEL14;
    __IO uint32_t KEYINSEL15;
    uint32_t RESERVED0[4];
    __IO uint32_t CKSEL0;
    __IO uint32_t CKSEL1;
    uint32_t RESERVED1[10];
} stc_keyscan_scr_bit_t;

typedef struct {
    __IO uint32_t SEN;
    uint32_t RESERVED0[31];
} stc_keyscan_ser_bit_t;

typedef struct {
    __IO uint32_t START;
    __IO uint32_t INTEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BUSY;
    uint32_t RESERVED1[28];
} stc_mau_csr_bit_t;

typedef struct {
    __I  uint32_t SMPU1EAF;
    __I  uint32_t SMPU2EAF;
    __I  uint32_t FMPUEAF;
    __I  uint32_t HMPUEAF;
    __I  uint32_t EMPUEAF;
    uint32_t RESERVED0[27];
} stc_mpu_sr_bit_t;

typedef struct {
    __O  uint32_t SMPU1ECLR;
    __O  uint32_t SMPU2ECLR;
    __O  uint32_t FMPUECLR;
    __O  uint32_t HMPUECLR;
    __O  uint32_t EMPUECLR;
    uint32_t RESERVED0[27];
} stc_mpu_eclr_bit_t;

typedef struct {
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct {
    __IO uint32_t AESRDP;
    __IO uint32_t AESWRP;
    __IO uint32_t HASHRDP;
    __IO uint32_t HASHWRP;
    __IO uint32_t TRNGRDP;
    __IO uint32_t TRNGWRP;
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t EFMRDP;
    __IO uint32_t EFMWRP;
    uint32_t RESERVED0[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

typedef struct {
    __IO uint32_t RG0E;
    __IO uint32_t RG1E;
    __IO uint32_t RG2E;
    __IO uint32_t RG3E;
    __IO uint32_t RG4E;
    __IO uint32_t RG5E;
    __IO uint32_t RG6E;
    __IO uint32_t RG7E;
    __IO uint32_t RG8E;
    __IO uint32_t RG9E;
    __IO uint32_t RG10E;
    __IO uint32_t RG11E;
    __IO uint32_t RG12E;
    __IO uint32_t RG13E;
    __IO uint32_t RG14E;
    __IO uint32_t RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_srge_bit_t;

typedef struct {
    __IO uint32_t RG0WP;
    __IO uint32_t RG1WP;
    __IO uint32_t RG2WP;
    __IO uint32_t RG3WP;
    __IO uint32_t RG4WP;
    __IO uint32_t RG5WP;
    __IO uint32_t RG6WP;
    __IO uint32_t RG7WP;
    __IO uint32_t RG8WP;
    __IO uint32_t RG9WP;
    __IO uint32_t RG10WP;
    __IO uint32_t RG11WP;
    __IO uint32_t RG12WP;
    __IO uint32_t RG13WP;
    __IO uint32_t RG14WP;
    __IO uint32_t RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_srgwp_bit_t;

typedef struct {
    __IO uint32_t RG0RP;
    __IO uint32_t RG1RP;
    __IO uint32_t RG2RP;
    __IO uint32_t RG3RP;
    __IO uint32_t RG4RP;
    __IO uint32_t RG5RP;
    __IO uint32_t RG6RP;
    __IO uint32_t RG7RP;
    __IO uint32_t RG8RP;
    __IO uint32_t RG9RP;
    __IO uint32_t RG10RP;
    __IO uint32_t RG11RP;
    __IO uint32_t RG12RP;
    __IO uint32_t RG13RP;
    __IO uint32_t RG14RP;
    __IO uint32_t RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_srgrp_bit_t;

typedef struct {
    __IO uint32_t SMPUBRP;
    __IO uint32_t SMPUBWP;
    __IO uint32_t SMPUACT0;
    __IO uint32_t SMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_scr_bit_t;

typedef struct {
    __IO uint32_t FRG0E;
    __IO uint32_t FRG1E;
    __IO uint32_t FRG2E;
    __IO uint32_t FRG3E;
    __IO uint32_t FRG4E;
    __IO uint32_t FRG5E;
    __IO uint32_t FRG6E;
    __IO uint32_t FRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_frge_bit_t;

typedef struct {
    __IO uint32_t FRG0WP;
    __IO uint32_t FRG1WP;
    __IO uint32_t FRG2WP;
    __IO uint32_t FRG3WP;
    __IO uint32_t FRG4WP;
    __IO uint32_t FRG5WP;
    __IO uint32_t FRG6WP;
    __IO uint32_t FRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_frgwp_bit_t;

typedef struct {
    __IO uint32_t FRG0RP;
    __IO uint32_t FRG1RP;
    __IO uint32_t FRG2RP;
    __IO uint32_t FRG3RP;
    __IO uint32_t FRG4RP;
    __IO uint32_t FRG5RP;
    __IO uint32_t FRG6RP;
    __IO uint32_t FRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_frgrp_bit_t;

typedef struct {
    __IO uint32_t FMPUBRP;
    __IO uint32_t FMPUBWP;
    __IO uint32_t FMPUACT0;
    __IO uint32_t FMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t FMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_fcr_bit_t;

typedef struct {
    __IO uint32_t HRG0E;
    __IO uint32_t HRG1E;
    __IO uint32_t HRG2E;
    __IO uint32_t HRG3E;
    __IO uint32_t HRG4E;
    __IO uint32_t HRG5E;
    __IO uint32_t HRG6E;
    __IO uint32_t HRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_hrge_bit_t;

typedef struct {
    __IO uint32_t HRG0WP;
    __IO uint32_t HRG1WP;
    __IO uint32_t HRG2WP;
    __IO uint32_t HRG3WP;
    __IO uint32_t HRG4WP;
    __IO uint32_t HRG5WP;
    __IO uint32_t HRG6WP;
    __IO uint32_t HRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgwp_bit_t;

typedef struct {
    __IO uint32_t HRG0RP;
    __IO uint32_t HRG1RP;
    __IO uint32_t HRG2RP;
    __IO uint32_t HRG3RP;
    __IO uint32_t HRG4RP;
    __IO uint32_t HRG5RP;
    __IO uint32_t HRG6RP;
    __IO uint32_t HRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgrp_bit_t;

typedef struct {
    __IO uint32_t HMPUBRP;
    __IO uint32_t HMPUBWP;
    __IO uint32_t HMPUACT0;
    __IO uint32_t HMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t HMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_hcr_bit_t;

typedef struct {
    __IO uint32_t ERG0E;
    __IO uint32_t ERG1E;
    __IO uint32_t ERG2E;
    __IO uint32_t ERG3E;
    __IO uint32_t ERG4E;
    __IO uint32_t ERG5E;
    __IO uint32_t ERG6E;
    __IO uint32_t ERG7E;
    uint32_t RESERVED0[24];
} stc_mpu_erge_bit_t;

