levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a2.h
typedef struct {
    uint32_t RESERVED0[15];
    __IO uint32_t USBAEP;
    __I  uint32_t EONUM_DPID;
    __I  uint32_t NAKSTS;
    uint32_t RESERVED1[3];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SD0PID_SEVNFRM;
    __IO uint32_t SODDFRM;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl_bit_t;

typedef struct {
    uint32_t RESERVED0[15];
    __I  uint32_t USBAEP;
    uint32_t RESERVED1[1];
    __I  uint32_t NAKSTS;
    __IO uint32_t EPTYP0;
    __IO uint32_t EPTYP1;
    __IO uint32_t SNPM;
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    uint32_t RESERVED3[2];
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl0_bit_t;

typedef struct {
    __IO uint32_t XFRC;
    __IO uint32_t EPDISD;
    uint32_t RESERVED0[1];
    __IO uint32_t STUP;
    __IO uint32_t OTEPDIS;
    uint32_t RESERVED1[1];
    __IO uint32_t B2BSTUP;
    uint32_t RESERVED2[7];
    __IO uint32_t NYET;
    uint32_t RESERVED3[17];
} stc_usbhs_doepint_bit_t;

typedef struct {
    uint32_t RESERVED0[19];
    __IO uint32_t PKTCNT;
    uint32_t RESERVED1[12];
} stc_usbhs_doeptsiz0_bit_t;

typedef struct {
    uint32_t RESERVED0[15];
    __IO uint32_t USBAEP;
    __I  uint32_t DPID;
    __I  uint32_t NAKSTS;
    uint32_t RESERVED1[2];
    __IO uint32_t SNPM;
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SD0PID;
    __IO uint32_t SD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl_bit_t;

typedef struct {
    __IO uint32_t STPPCLK;
    __IO uint32_t GATEHCLK;
    uint32_t RESERVED0[3];
    __IO uint32_t ENL1GTG;
    __IO uint32_t PHYSLEEP;
    __IO uint32_t SUSP;
    uint32_t RESERVED1[24];
} stc_usbhs_gcctl_bit_t;

typedef struct {
    __IO uint32_t PERI0;
    __IO uint32_t PERI1;
    uint32_t RESERVED0[2];
    __IO uint32_t CKS0;
    __IO uint32_t CKS1;
    __IO uint32_t CKS2;
    __IO uint32_t CKS3;
    __IO uint32_t WDPT0;
    __IO uint32_t WDPT1;
    __IO uint32_t WDPT2;
    __IO uint32_t WDPT3;
    uint32_t RESERVED1[4];
    __IO uint32_t SLPOFF;
    uint32_t RESERVED2[14];
    __IO uint32_t ITS;
} stc_wdt_cr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __IO uint32_t UDF;
    __IO uint32_t REF;
    uint32_t RESERVED1[14];
} stc_wdt_sr_bit_t;


typedef struct {
    stc_adc_str_bit_t                        STR_b;
    uint32_t                                 RESERVED0[8];
    stc_adc_cr0_bit_t                        CR0_b;
    stc_adc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[32];
    stc_adc_trgsr_bit_t                      TRGSR_b;
    uint32_t                                 RESERVED2[96];
    stc_adc_exchselr_bit_t                   EXCHSELR_b;
    uint32_t                                 RESERVED3[344];
    stc_adc_isr_bit_t                        ISR_b;
    stc_adc_icr_bit_t                        ICR_b;
    stc_adc_isclrr_bit_t                     ISCLRR_b;
    uint32_t                                 RESERVED4[40];
    stc_adc_synccr_bit_t                     SYNCCR_b;
    uint32_t                                 RESERVED5[656];
    stc_adc_awdcr_bit_t                      AWDCR_b;
    stc_adc_awdsr_bit_t                      AWDSR_b;
    stc_adc_awdsclrr_bit_t                   AWDSCLRR_b;
    uint32_t                                 RESERVED6[32];
    stc_adc_awd0chsr_bit_t                   AWD0CHSR_b;
} bCM_ADC_TypeDef;

typedef struct {
    stc_aes_cr_bit_t                         CR_b;
} bCM_AES_TypeDef;

typedef struct {
    stc_aos_intsfttrg_bit_t                  INTSFTTRG_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL1_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL2_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL3_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL4_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL0_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL1_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL2_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL3_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL4_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL5_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL6_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL7_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL0_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL1_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL2_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL3_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL4_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL5_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL6_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL7_b;
    stc_aos_dma_trgselrc_bit_t               DMA_TRGSELRC_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR0_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR1_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR2_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR3_b;
    stc_aos_pevnttrgsr_bit_t                 PEVNTTRGSR12_b;
    stc_aos_pevnttrgsr_bit_t                 PEVNTTRGSR34_b;
    stc_aos_tmr0_htssr_bit_t                 TMR0_HTSSR_b;
    stc_aos_tmr2_htssr_bit_t                 TMR2_HTSSR_b;
    stc_aos_hash_itrgselb_bit_t              HASH_ITRGSELB_b;
    stc_aos_hash_itrgsela_bit_t              HASH_ITRGSELA_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR0_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR1_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR2_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR3_b;
    stc_aos_ots_trg_bit_t                    OTS_TRG_b;
    stc_aos_adc1_itrgselr_bit_t              ADC1_ITRGSELR0_b;
    stc_aos_adc1_itrgselr_bit_t              ADC1_ITRGSELR1_b;
    stc_aos_adc2_itrgselr_bit_t              ADC2_ITRGSELR0_b;
    stc_aos_adc2_itrgselr_bit_t              ADC2_ITRGSELR1_b;
    stc_aos_adc3_itrgselr_bit_t              ADC3_ITRGSELR0_b;
    stc_aos_adc3_itrgselr_bit_t              ADC3_ITRGSELR1_b;
    uint32_t                                 RESERVED0[1568];
    stc_aos_pevntnfcr_bit_t                  PEVNTNFCR_b;
} bCM_AOS_TypeDef;

